class panel:

    def 瞿志豪(Michel)：
        Natsdaq

    def vicent:
        b84 華楊、悠遊卡董事

    def Bruce:
        EMBA95 矽谷創業，開曼控股

    def 司徒嘉恆(Seetoo):
        b84，台大經濟->國外法律，創拓法律事務
        新創集資等等，到IPO或是併購階段從後端來探討
        web 1.0時代，大學畢業做網路媒體，失敗跟當時的法律因素也有關

    def 詹德弘(Joseph):
        b80, Giga media，華威、之初、台式架構/美式架構，大小都有看過
        前幾年把舊的東西拆掉，新的東西還沒有起來

    def ???:
        共同的問題：法律環境為什麼如此不友善？
        往往最後要到開曼去
        協助中小企業處改善經營的法律面問題
        中小企業處法規調適會
        不是不能，而是不為

    def 羅智光律師:
        not here yet

    def panel:
        Jack:太陽花->青年顧問->理解政府，政府應該建構生態系
        prob1:
            技術股？是否課稅？
            選擇權：彈性不足
            特別股：無法議定股票上面的權利，對投資人來說沒有辦法保障權益，長遠來看並不好
            可轉換公司債：在雙方對於估值沒有共識的情況之下無法採用，在未上市的情況之下無法發行
            股票面額：目前已經開放到一塊錢，但是否足夠彈性有待討論
            閉鎖型公司（無形資產之鑑價）：公開發行之前是屬於創業團隊跟投資人之間的，應該可以做適度的放寬
        Mr. 瞿:
            証所稅的修法把台灣的門都關起來了
            新創公司的valuation，過去台灣有一套自己的土規則：賣舊股換新股，把賣得的價格來認公司的新股
            自從証所稅開徵之後這條路就關掉了，所以考慮改成用stock option等方式突圍
            改制之後很多作法跟原來舊有的現行法可能有衝突
            問題壞在行政機關、經濟部跟金管會把很多東西鎖的很死
            特別股在公司法裡面其實沒有限制，理論上可以在現行公司法的架構下面做特別股的約定
            但是經濟部方面就有很多限制，例如特別股不能一股轉成多普通股，轉換的時候常常會被行政單位打槍
            公司法對於stock option其實沒有太多限制，但是一家公司在公開發行的時候會有很多主管機關，例如stock option不能發給顧問、外部律師、partime員工等等，如果不能把選擇權作為一種資源的話很難leverage
            金管會還規定stock發行單次不能超過10%，總額不能超過15%，造成很大的限制
            其實有很多walk around，但是實在是浪費太多時間了
            可轉換債：也是法律面沒有規定，大多是受限行政命令
            conclustion：其實只要主管機關放寬行政命令的限制
        Vicent:
            曾經送上去，可轉換特別股的部分，原先送的時候有過，但真的要做的時候就被打槍了
            盈餘轉??
            運用民法做約定，可以做一些處理
            上市規定有限制資本額，造成在資本小但市值大的公司難以上市
            IPO虧損，只能當年認列？？？完全不懂阿阿阿阿
        Bruce:
            台美的差異：工業時代vs資訊時代
            1)股票：有價證券==土地、廠房...etc，資金具有票面價值，可以做有形資產的直接轉換
                    資訊時代：證券==價值的載具，找第一筆投資是由創業者跟投資方雙方認定
                    pre-money vs post-money：prototype <-> pre-money; 
                    knowledge worker:沒有有形的資產，耗的是腦袋，需要拜託投資人用溢價的時候來談，300w->20元/股
                    造成創業者被資本市場壓著打，經過一兩輪之後可能只剩下10~20%
            2)conclusion:拋棄工業時代的思維，才能夠接上資訊時代
        Mr. 司徒:
            MBA地下網路雜誌，第一個把寫NBA review放到網路上(1997)，大三的時候，做了幾年流量變高，開始吸引注意
            1999-2000年的時代，公司法128條規定股份有限公司需要七名發起人，以及最低實收資本額的限制
            驗資的規定都是騙人的，只要湊前過來讓會計師看一眼出個報告就可以了
            當時要湊一百萬很難，造成沒有很快的機制可以弄出一個法人的身分去跟投資人談
            最後結局就變成以員工的身分加入別人的網路公司
            paper company: guys look, we can really create something!
            出技術的人是外國的人，把東西賣出來弄到台灣，但是因為外人投資條例，需要會計師審核營運計畫等等
            所有來找台灣的新創公司要做技術作價的幾乎結果都是不可能，最後變成要先從資金來做兩層，出技術的人需要先把技術賣掉，在用賣得的錢來買股權，這樣就是兩層稅...
            閉鎖型公司：保留再談
        Mr.詹:
            實收資本額->保障債權人、保障交易安全的概念，會導致後面的部份卡住（資本三原則的堅持）
            法規的瑣碎：想到什麼就寫在公司法裡面，小公司的問題都沒有被考慮到
            favor外國人：對外國人比較好，例如公司法規定外資持股超越40%可以不適用對於技術股的限制
        Mr.??:
            公司法瑣碎？應該是很多原則性的規定，依照憲法的法律保留原則，「法律沒規定的你就不能做」
            行政機關到底保護誰？政府把消費者當笨蛋、把創業者當笨蛋
            公司自治？Shareholder agreement->直接透過章程進行自治
            股份可能有屬人主義，持股超過一定比例就需要限制部分行為
            股份本來就不是完全客觀的形態，會因為公司的形態跟產業而有不同
            消除債跟股之間的差異
            高鐵的特別股就是債！
            公司法只管形式，不管實質
            虧損的公司就不能上市，但科技公司看的是發展
            政府認為公司虧損，所以你不能夠投資？什麼？
            資本三原則：是個歷史包袱，資本一下去就是一個歷史的存在了XDDD
        羅律師：
            10多年前就接手公司法的修正計畫、亞太營運中心、國發會的創新創業法規，都試著在公部門調整
            企併法->與公司法有衝突，只能用折衷的方式漸進式的去推
            10幾年來公司法的演進，成果相當有限，只能walk around來處理
            最大的欺騙就是公司的實收資本額
            資產的狀況跟資產的淨值才是真的，實收資本額是一個欺騙大眾的方式
            對於無知的人應該要教育他，而不是保護他
            公司法是一個競爭市場，你不競爭的話就是被別人超越
            公司限制多的話相對就是執行比較簡單，人頭股東的事情主管機關其實也都知道，但是現況就是需要繞路
            黃金股->股權不等值，把黃金股留給技術團隊，目前在國發會推動的進展還是很遲緩
        邵老師：
            walk around不一定會成功，耗費很多精力、時間跟想像力
            驗資有很大的爭議，但我們要花一節課來教，其他國家不用！
            YC-> safe simple agreemet of xx ecoty
            基本的地基怎麼樣跟別人蓋的一樣
            改革動能都是一步一步被消耗掉，現在在跑道上的人剩很少了
            台灣對外資很友善，對外資幾乎都沒有改善
        panel:
            對大部分人來說是不公平的，台灣的環境讓創業者跟法律專家暴露在很高的風險上，你知道怎麼去香港仲裁嗎？
            台灣資本市場在過去是世界知名的，對small cap有利
            前面這條路斷掉之後，很多大所就不少生意可以做
            Bruce:
                法律的設計是防弊重於興利，1999年的時候掌管法律的人自己開後門去鑽
                硬要把工業時代的制度改成資訊時代的制度，可能會造成很多漏洞
                從體制外去想這件事情，台灣跟英國一樣有很多離島，可以做做看阿XDDDDDD
            Vicent:
                稅的問題XDDD
                台北市就沒稅收了
                最後就會變成折衷的方案，而不是最好的方案
                openration跟公司的設立分開
            詹S：
                函釋：專家打臉->專家是誰？不跟你講XDDD
            司徒S:
                積習不改才是真正的問題
                五年之中已經修過三次公司法，不動就是不動
                法律如果沒有可預測性跟安定性，會容易造成混亂，因此需要設定自治的空間
                要想辦法脫離歷史的包袱
            羅S:
                157條，有時候函釋會超越法律
                改的東西往往都不是實務上需要的東西，改的非常不到位
                併購：以有限公司與股份有限公司為限->以具有法人資格的公司為限，這樣就好了阿！！！
                要修就可以亂修XDDD
                ex.加薪四法<->牴觸了股東是owner的概念

    QA：
        Q：這個國家不想要欠稅收，但是新創公司需要的是活下去
        要替新創公司開路，應該要撇除以往大公司的案例
        A：中小企業處已經在做改正，拿到股份就要開始計算價值，當他在第一次交易獲利的時候再獲利所得來課
        A：投資方承擔不對等的風險，因為架構沒有彈性因此造成資本方跟創業家對立，清算、減資這些手段對投資方不利
        A：RSU取代option的趨勢，等不及修法啦XDDD ，最直接的作法就是直接切一個新的出來
        A：制度跟國際的遊戲規則跟國外差太多，他們會覺得台灣的公司太麻煩，就算想要投還會加上一個regulational discount
        A：為了上市可能需要做增資，因為修法時程很長，可以先用外部措施開一道口，然後再逐步修
        A：台灣根本就沒有證券市場應該有的infrastructure，公司自治是你要依照我的概念來運作
        '台灣的公司自治就是你要依照我的規則運作'
        公司代號5266，還要做公司規則檢查表XDDD，這個也不行，那個也不行...
        A：對經濟罪犯的處罰非常輕，是個掏空的天堂，03-04突然取消了超過兩億的公司要公發的限制，所以沒有人知道公絲的運作到底在幹嘛，結果CEO把廠房壓了，把錢匯出去境外，號稱是要備料，但軟體哪裡需要備料
        「強制公開發行」這件事情，實收資本額永遠都是一億xxxx萬，不會超過兩億->尊重公司自治，取消強制
        資本三原則跟面額十元整個就是很荒謬，當時寫法律的人對於cooperation finance完全沒有概念
        是行政官員還是立法委員在治國？一堆規定都是在細則，公司法反而是非常空泛的框架
        閉鎖型公司很像是宅男公司的樣子
        自經區->一國兩制的試驗區
        這部公司法在那邊危害蠻大的
        法治上需要破壞性創新才有可能突圍
        公司法是基本法，定不好就會擾亂其他應用，基礎要動的更頻繁，才能跟上時代！
        上市之後政府居然沒有監督、管制，會計師可以做的事情太多了，只要花錢就什麼都可以做
        為什麼不能有公派的稽核，並且要rotate，看到台灣備掏空的金額都會覺得很不可思議
        驗資在90年以前都是以政府來管，後來發現人力不夠就讓會計師事務所來處理
        公司在薩摩亞，趕快搬走XDD
        top down的改變，需要visionary的引導
        行政權過大的問題
        股權式crowd founding->一堆不可能











